[
  {
    "id": "1",
    "title": "Classic Spaghetti Carbonara",
    "author": "Mario Batali",
    "ingredients": [
      "1 pound spaghetti",
      "6 ounces pancetta or guanciale, diced",
      "4 large egg yolks",
      "1 cup freshly grated Pecorino Romano cheese",
      "Freshly ground black pepper"
    ],
    "img_url": "https://images.unsplash.com/photo-1633337474564-1d9478ca4e2e?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=2671&q=80",
    "directions": [
      "Bring a large pot of salted water to a boil. Add the spaghetti and cook until al dente, about 8 minutes.",
      "Meanwhile, in a large skillet, cook the pancetta over medium heat until crispy, about 8 minutes.",
      "In a large bowl, whisk together the egg yolks and Pecorino Romano cheese.",
      "When the spaghetti is done, reserve 1 cup of the cooking water, then drain the pasta and immediately add it to the skillet with the pancetta. Toss to combine.",
      "Remove the skillet from the heat and pour in the egg mixture, tossing quickly and constantly to coat the pasta. If the mixture is too thick, add a little of the reserved cooking water to thin it out.",
      "Season with black pepper to taste and serve immediately."
    ]
  },
  {
    "id": "2",
    "title": "Roasted Chicken with Lemon and Rosemary",
    "author": "Ina Garten",
    "ingredients": [
      "1 (4 to 5 pound) roasting chicken",
      "Kosher salt and freshly ground black pepper",
      "2 lemons, quartered",
      "1 head garlic, halved crosswise",
      "1/4 cup olive oil",
      "2 tablespoons chopped fresh rosemary leaves"
    ],
    "img_url": "https://images.unsplash.com/photo-1518492104633-130d0cc84637?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=2052&q=80",
    "directions": [
      "Preheat the oven to 425 degrees F.",
      "Remove the chicken giblets. Rinse the chicken inside and out. Remove any excess fat and leftover pin feathers and pat the outside dry. Liberally salt and pepper the inside of the chicken.",
      "Stuff the cavity with the lemons and garlic.",
      "Brush the outside of the chicken with the olive oil and sprinkle the chopped rosemary on top.",
      "Roast the chicken for 1 1/2 hours, or until the juices run clear when you cut between a leg and thigh. Remove the chicken and vegetables to a platter and cover with aluminum foil for about 20 minutes.",
      "Slice the chicken onto a platter and serve it with the vegetables."
    ]
  },
  {
    "id": "3",
    "title": "Beef Stroganoff",
    "author": "Julia Child",
    "ingredients": [
      "1 pound beef tenderloin, cut into thin strips",
      "Kosher salt and freshly ground black pepper",
      "2 tablespoons unsalted butter",
      "1 onion, chopped",
      "1/2 pound mushrooms, sliced",
      "2 cloves garlic, minced",
      "1/2 cup beef broth",
      "1/2 cup sour cream",
      "1 tablespoon Dijon mustard",
      "Egg noodles, cooked according to package directions, for serving"
    ],
    "img_url": "https://images.unsplash.com/photo-1644592219048-5c070fd3c91c?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1922&q=80",
    "directions": [
      "Season the beef with salt and pepper.",
      "In a large skillet, melt the butter over medium-high heat. Add the beef and cook until browned, about 5 minutes. Remove the beef from the skillet and set aside.",
      "Add the onion, mushrooms, and garlic to the skillet and cook until softened, about 5 minutes.",
      "Add the beef broth and stir to scrape up any browned bits from the bottom of the skillet. Bring to a simmer and cook until the liquid has reduced by half, about 5 minutes.",
      "Stir in the sour cream and mustard. Return the beef to the skillet and cook until heated through, about 2 minutes.",
      "Serve the beef stroganoff over egg noodles."
    ]
  },
  {
    "id": "4",
    "title": "Grilled Shrimp Skewers",
    "author": "Bobby Flay",
    "ingredients": [
      "1 pound large shrimp, peeled and deveined",
      "2 cloves garlic, minced",
      "2 tablespoons olive oil",
      "1 tablespoon honey",
      "1 tablespoon soy sauce",
      "1 tablespoon fresh lime juice",
      "Kosher salt and freshly ground black pepper",
      "Bamboo skewers, soaked in water for 30 minutes"
    ],
    "img_url": "https://images.unsplash.com/photo-1517274885739-760f0910eefc?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=3570&q=80",
    "directions": [
      "Preheat a grill or grill pan to medium-high heat.",
      "In a large bowl, whisk together the garlic, olive oil, honey, soy sauce, lime juice, salt, and pepper.",
      "Add the shrimp to the bowl and toss to coat in the marinade.",
      "Thread the shrimp onto the skewers.",
      "Grill the skewers for 2-3 minutes per side, until the shrimp are cooked through and pink.",
      "Serve the shrimp skewers hot off the grill."
    ]
  }
]
